In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("retouren.csv")

In [5]:
df.describe()

,order_item_id,item_id,brand_id,item_price,user_id,return
count,75007.000000,75007.000000,75007.000000,75007.000000,75007.000000,75007.000000
mean,37504.000000,784.831949,28.834362,60.662926,25740.186623,0.450105
std,21652.800158,679.962960,26.808145,44.723474,12947.166520,0.497508
min,1.000000,1.000000,1.000000,0.000000,9.000000,0.000000
25%,18752.500000,176.000000,5.000000,29.900000,14674.000000,0.000000
50%,37504.000000,479.000000,24.000000,49.900000,30486.000000,0.000000
75%,56255.500000,1517.000000,43.000000,74.900000,36479.000000,1.000000
max,75007.000000,2224.000000,137.000000,999.000000,43801.000000,1.000000

In [19]:
li = df[df.item_price == 0].item_id.unique().tolist()

Random Forest, Gradient Boosting, logisteische Regression, support vector machines

Testdaten impiziert einbauen

In [20]:
li

[157,
 62,
 312,
 553,
 807,
 1014,
 239,
 1436,
 1725,
 1904,
 1951,
 1472,
 2025,
 2103,
 2121,
 2199,
 2213]

In [30]:
df_2 = df.loc[df.item_id == li[1] ]

In [47]:
df.isnull().any()

order_item_id    False
order_date       False
delivery_date     True
item_id          False
item_size        False
item_color       False
brand_id         False
item_price       False
user_id          False
user_title       False
user_dob          True
user_state       False
user_reg_date    False
return           False
dtype: bool

In [48]:
df[df.user_dob.isnull()]

,order_item_id,order_date,delivery_date,item_id,item_size,item_color,brand_id,item_price,user_id,user_title,user_dob,user_state,user_reg_date,return
11,12,2016-06-22,2016-06-27,212,l,grey,5,39.9,30824,Mrs,NaN,Lower Saxony,2016-06-23,0
12,13,2016-06-22,2016-06-27,378,l,black,5,59.9,30824,Mrs,NaN,Lower Saxony,2016-06-23,0
13,14,2016-06-22,2016-06-27,222,l,black,3,29.9,30824,Mrs,NaN,Lower Saxony,2016-06-23,0
41,42,2016-06-23,2016-06-26,394,40,grey,44,105.0,30827,Mrs,NaN,Hamburg,2016-02-09,1
42,43,2016-06-23,2016-06-26,394,40,black,44,90.0,30827,Mrs,NaN,Hamburg,2016-02-09,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
74959,74960,2016-08-20,2016-08-23,1512,l,purple,46,29.9,43797,Mrs,NaN,North Rhine-Westphalia,2016-08-21,1
74960,74961,2016-08-20,2016-08-23,1412,38,blue,54,119.9,43797,Mrs,NaN,North Rhine-Westphalia,2016-08-21,1
74961,74962,2016-08-20,2016-08-23,1607,l,stained,29,59.9,43797,Mrs,NaN,North Rhine-Westphalia,2016-08-21,1
74962,74963,2016-08-20,2016-08-23,1471,46,blue,113,69.9,43797,Mrs,NaN,North Rhine-Westphalia,2016-08-21,0
74963,74964,2016-08-20,2016-08-23,498,xl,green,11,49.9,43797,Mrs,NaN,North Rhine-Westphalia,2016-08-21,1